[
  {
    "a1": [
      ["A1 - Početnik"],
      [
        "Obično postoje dve vrste početnika, pravi i lažni. Pravi početnik nikada ranije nije učio engleski, dok je lažni početnik učio nekada davno i zaboravio, ili je, što se često dešava, pokupio par izraza iz serija i filmova koje gleda koje bi mu pomogle u svakodnevnoj konverzaciji."
      ],
      [
        "Početnici mogu izraziti šta žele u ograničenom broju situacija (na ulici, u prodavnici, restoranu), mogu pričati u kratkim rečenicam o osnovnim stvarima koje su im poznate (meni u restoranu, cene, datumi, upoznavanje i slično). U zavisnosti od toga koliko im je jezik sličan jeziku koje uče, toliko će moći da shvate i budu shvaćeni. Na primer, obično su potvrdne i odrične rečenice lakše da se nauče od upitnih jer je tu potrebna rečenična struktura koja nije slična onoj u srpskom jeziku."
      ],
      [
        "Početnici još uvek ne mogu da prošire temu razgovora i pitaju spontana pitanja. Takođe teško razumeju govor na drugom jeziku osim ako ta osoba ne govori polako. Uglavnom pasivno slušaju i koriste govor tela da nadomeste reč koja im nedostaje."
      ]
    ]
  },
  {
    "a2": [
      ["A2 - Viši početnici"],
      [
        "Viši početnici su obično osobe koje su učile engleski tu i tamo, rascepkano na više mesta i bez koherentnosti. Oni koji produže pravo sa A1 nivoa na A2 nivo su obično sigurniji u svoje znanje, takođe na sistematičniji i lakši način usvajaju novo. Zbog ovoga upravo nagoveštavamo našim polaznicima da je učenje jezika stalan proces, ako ga prekinete ili pravite pauzu, biće vam teže da nastavite. Bolji je stalan rad umanjenim tempom umesto intenzivnog a isprekidanog."
      ],
      [
        "Viši početnicimogu da pričaju o većem broju tema od početnika, uključujući putovanja, posao, šoping, hobi i slično. Mogu izraziti svoje mišljenje na engleskom, postavljati pitanja i odgovarati na njih. Uglavnom mogu lako pričati o sadašnjem vremenu ili o planovima za budućnost sa going to."
      ],
      [
        "Viši početnici još uvek ne mogu da govore tečno i dosta zastajkuju tražeći reč koja im nedostaje. Imaju poteškoća sa postavljanjem pitanja, kao i da odgovaraju koristeći celu rečenicu. Takođe, prošlo vreme im zadaje dosta poteškoća zbog nepravilnih glagola. I dalje imaju potrebe da čuju objašnjenje i prevod na srpskom i sve prevode sa engleskog na srpski i obrnuto pri upotrebi jezika."
      ]
    ]
  },
  {
    "b1": [
      ["B1 - Samostalni govornik"],
      [
        "Ovaj nivo se često naziva samostalnim, jer je preloman za učenika koji tek tada počinje da slobodno govori na engleskom. Rečenice su možda iscepkane, nepravilne, sa puno pauza i neverbalnih potpomaganja, ali mogu preneti svoju ideju i objasniti šta žele."
      ],
      [
        "B1 govornicimogu da pričaju o ličnim temama, poslu, planovima za naredni odmor ili o tome šta su radili na prethodnom. Pouzdano pričaju o temama koje su im poznate, ali imaju poteškoća da se snađu u novim situacijama. Greške koje se javljaju na ovom nivou kod srpskih govornika su kod modalnih glagola (često se čuje must to umesto must zbog srpskog uticaja moram da). Ovo su greške koje se moraju ispraviti na ovom nivou da ne bi postale fosilizovane."
      ],
      [
        "Samostalni govornici ipak obično ne mogu da pričaju tečno, dosta zastajkuju jer žele da prevedu bukvalno reč sa maternjeg na engleski, iako mogu koristiti lakši sinonim (na primer, za reč postići bi tražili reč poputachieve umesto mnogo uobičajenije rečiget koju već znaju). Takođe, iako do sada već znaju da kažu dosta na engleskom, nedostaje im samopouzdanje, ovde je konstantan rad veoma važan je prelazni nivo između nesigurnog i sigurnog govornika."
      ]
    ]
  },
  {
    "b2": [
      ["B2 - Pouzdani govornik"],
      [
        "Ovaj nivo služi za usavršavanje govornih i pismenih veština. Na njemu se usavršavaju veštine slušanja i čitanja, mogu se dati duži i komplikovaniji tekstovi za čitanje, a govor postaje sigurniji i tečniji. Na ovom nivou se ispravljaju greške i idealan je da se ponovno oformi jača baza znanja na kojoj bi se gradio vokabular (reči i izrazi) potreban za C nivoe."
      ],
      [
        "Učenici na ovom nivou mogu da pričaju o skoro svim temama, mada im nedostaju reči konkretno vezane za tu temu (na primer, ako pričaju o tehnologiji, medicini ili nekoj drugoj stručnoj temi). Stoga je ovo idealan nivo da se i van časa koristi engleski. B2 je nivo na kom se napokon mogu početi gledati serije i filmovi bez titla, čitati novine, knjige i slično u izvornom obliku – napisanom za izvorne govornike, ne učenike.Ovi pouzdani govornici se tek sada mogu sporazumeti prilično dobro sa izvornim govornicima i diskutovati o temama koje i sa lakoćom preneti svoje mišljenje."
      ],
      [
        "Ono što je i dalje izazov je taj da ne mogu da se prebace u potpunosti na engleski. Ovi govornici prevode rečenične strukture sa maternjeg na strani jezik, time koristeći strukturu jezika koja nije prirodna jeziku koji uče, tako da mogu dovesti do nesporazuma ako pričaju sa izvornim govornikom engleskog, ili nekog drugog jezika da nije njihov maternji. Ipak, tu grešku mogu lako otkloniti ili pojasniti detaljnije koristeći drugu strukturu. Primeri za to su tipične kolokacije koje se mogu pogrešno prevesti sa srpskog na engleski (npr. strongrain umesto heavyrain, on thepicture umesto in thepicture i slično)."
      ]
    ]
  },
  {
    "c1": [
      ["C1 - Napredni govornici"],
      [
        "Ovde se govornici ovde fokusiraju na to ne samo da prenesu značenje, već i da ga iskažu na način koji bi bio najprirodniji tom jeziku. Stoga je ovde veliki deo posvećen učenju reči i izraza koje idu zajedno u engleskom jeziku. U to spadaju kolokacije, idiomi, frazalni glagoli i stručni izrazi"
      ],
      [
        "Napredni govornici mogu da tečno izraze svoje mišljenje i da ga prenesu na skoro sličan način kako bi ga preneli i na maternjem jeziku. Srpskim učenicima se ovde tu i tamo i dalje potkradaju osnovne greške, čak i one poput trećeg lica jednine ili reda reči u rečenici kod pitanja. Ipak, greške ovog tipa se smatraju omaškom nastalo upotrebom, a ne neznanjem jer je govornik upoznat sa pravilima. Opasnost je da te greške postanu fosilizovane, jer se onda teško ispravljaju, tako da se ponavljanjem i vežbom se trebaju ispraviti i te najosnovnije poput dodavanja –s u trećem licu jednine."
      ],
      [
        "Ovi govornici i dalje ne mogu da razumeju sa lakoćom kompleksnije tekstove, knjige, originalne članke iz novina i trebalo bi zato proširiti vokabular i navići se na jezičku strukturu. Većini učenika problem zadaje pisanje, zbog manjka prethodne vežbe, i osećaju se nesigurno kada treba da sastave poslovno pismo, jer je razlika između formalnog i neformalnog engleskog i dalje nejasna."
      ]
    ]
  },
  {
    "c2": [
      ["C2 - Usavršeni govornici"],
      [
        "Smatra se da su C2 govornici usavršili jezik toliko da mogu da se snađu u bilo kojoj situaciji. Ovo je najviši nivo i teško ga je ostvariti, potrebno je dosta godina, truda i rada da bismo došli do tog nivoa da kad pričamo na engleskom, zaista i mislimo na tom jeziku."
      ],
      [
        "C2 govornici su već oni koji mogu tečnoda govore, diskutuju, pišu, čak se i šale na stranom jeziku. Osećaju se komforno koristeći različite jezičke strukture, umeju da prenesu svoje mišljenje na isti način kao što bi ga preneli na maternjem jeziku. Kažemo na isti, ali u stvarnosti čim se koristi drugačiji jezik, kao što će govornici na ovom nivou znati, koristimo i drugačiji način izražavanja. Upravo te nijanse jezika usavršeni govornici mogu da izraze."
      ],
      [
        "Kažemo usavršeni, a ne savršeni jer ovi govornici i se i dalje suočavaju sa nizom problema koji ih sprečava da budu native-like, tj. da pričaju poput izvornih govornika. Na primer, i dalje ne mogu biti sigurni pri upotrebi predloga posle glagola osim ako ih nisu naučili napamet. Takođe, kao govornici srpskog jezika, gde članovi ne postoje, a, and i the mogu biti pokazatelji razlike između C2 nivoa i izvornog govornika. Stalan rad i upotreba je neophodna da bi C2 govornik ostao na tom nivou."
      ]
    ]
  }
]
